[
    {
        "title": "Doctor Strange in the Multiverse of Madness 480p | 720p | 1080p",
        "description": "Download Doctor Strange in the Multiverse of Madness (2022) WEB-DL Full Movie (Hindi-English) 480p &amp; 720p &amp; 1080p Qualities. This is a Hollywood Hindi Dubbed movie and Available",
        "linkmovie": "https://nxprime.site/download-Doctor-Strange-in-the-Multiverse-of-Madness-movie-2022-dual-audio-hindi-clean-english-v3-hdcamrip-480p-720p-1080p/",
        "tag1": "Download Doctor Strange in the Multiverse of Madness Movie 1080p",
        "tag2": "Download Doctor Strange in the Multiverse of Madness Movie 480p",
        "tag3": "Download Doctor Strange in the Multiverse of Madness Movie 720p",
        "tag4": "Download Doctor Strange in the Multiverse of Madness Movie full movie",
        "tag5": "Download Doctor Strange in the Multiverse of Madness Movie movie",
        "tag6": "Download Doctor Strange in the Multiverse of Madness Movie nxprime",
        "tag7": "Doctor Strange in the Multiverse of Madness Movie 1080p movie download",
        "tag8": "Doctor Strange in the Multiverse of Madness Movie 480p movie download",
        "tag9": "Doctor Strange in the Multiverse of Madness Movie 720p movie download",
        "tag10": "Doctor Strange in the Multiverse of Madness Movie download",
        "tag11": "Doctor Strange in the Multiverse of Madness Movie dual audio",
        "tag12": "Doctor Strange in the Multiverse of Madness Movie full movie download",
        "tag13": "Doctor Strange in the Multiverse of Madness Movie hd movie download",
        "tag14": "Doctor Strange in the Multiverse of Madness Movie movie download",
        "tag15": "Doctor Strange in the Multiverse of Madness Movie watch online",
        "year": "2022",
        "langu": "Dual Audio [Hindi (ORG)+English]",
        "size": "300MB | 1.2GB | 2.4GB",
        "imgs": "https://i.ibb.co/kXSNYS4/FRSw-N9f-WQAAfu-OV.jpg",
        "rating": "6.9/10",
        "downloadtitl": "Download Doctor Strange in the Multiverse of Madness 480p | 720p | 1080p Download Links",
        "story": "Recognizing witchcraft runes, Strange consults Wanda Maximoff for help but realizes that she is responsible for the attacks. After acquiring the Darkhold and becoming the Scarlet Witch, Maximoff believes that controlling Chavez’s powers will allow her to reunite with Billy and Tommy, the children she created during her time in Westview.[N 3] When Strange refuses to surrender Chavez, Maximoff attacks Kamar-Taj, killing many sorcerers. Chavez accidentally transports herself and Strange to Earth-838 while Maximoff uses the Darkhold to “dream-walk”, taking control of her Earth-838 counterpart, who lives a suburban life with her own Billy and Tommy. A surviving sorceress sacrifices herself to destroy the Darkhold and break the dream-walk. Enraged, Maximoff forces Wong to lead her to Mount Wundagore, the source of the Darkhold’s power, to reestablish the dream-walk.",
        "screen1": "https://imgur.com/nnanukj.jpg",
        "screen2": "https://imgur.com/jGVOjPn.jpg",
        "screen3": "https://i.imgur.com/p0fRllf.jpg",
        "screen4": "https://i.imgur.com/JcggAjl.jpg",
        "link480p":"https://nxprime.site/movie.html#DoctorStrangeintheMultiverse480p",
        "link720p":"https://nxprime.site/movie.html#DoctorStrangeintheMultiverse720p",
        "link1080p":"https://nxprime.site/movie.html#DoctorStrangeintheMultiverse1080p",
        "playlnik480p": "1jN-ZQcvVrF1tPGDaGrNqPmN4Ok6H_Ult",
        "playlnik720p": "1I1AA7qw0Fz8C8f7bFRaznhgMS5Prq28x",
        "playlnik1080p": "1eMPT-Z4kFuTk10vYedXEzDqgZPYr3iLE"
    }
    
]